identification division.
program-id. ProgrammeTutoCobol1.

SCREEN SECTION.
1 pla.
       2 BLANK SCREEN.
       2 LINE 6 COL 10 VALUE 'Hello world by xhackax47 in COBOL !!!'.
       
procedure division.

display pla.

stop run.
