      *HelloWorld COBOL
       IDENTIFICATION DIVISION.
       PROGRAM-ID. hello.
       PROCEDURE DIVISION.
       DISPLAY 'Hello world by xhackax47 in COBOL !!!'.
       STOP RUN.
