*> Sample GnuCOBOL program
identification division.
program-id. hellonew.
procedure division.
display
"Hello, it's new free format code COBOL !"
end-display
goback.
