      *HelloWorld COBOL
       IDENTIFICATION DIVISION.
      * Nom du programme
       PROGRAM-ID. hello.
       PROCEDURE DIVISION.
       DISPLAY 'Hello world par xhackax47 mais en COBOL !!!'.
       STOP RUN.
