*> Exemple Free format code en COBOL (utilisez la commande cobc -x -free file.cob pour compiler en free format)
identification division.
program-id. hellonew.
procedure division.
display
"HelloWorld, mais cette fois en free format COBOL !"
end-display
goback.
